lains/stm32-linky-display/src/main.cpp
/* Includes ------------------------------------------------------------------*/
#include "Stm32Serial.h"
#include "TicUnframer.h"

extern "C" {
#include "main.h"
#include <string.h>
#include <stdio.h>

static void SystemClock_Config(void); /* Defined below */
static uint8_t LCD_Init(void); /* Defined below */
static void LTDC_Init(void); /* Defined below */
static void copy_framebuffer(const uint32_t *pSrc, uint32_t *pDst, uint16_t x, uint16_t y, uint16_t xsize, uint16_t ysize); /* Defined below */

/* Private typedef -----------------------------------------------------------*/
extern LTDC_HandleTypeDef hltdc_eval;
static DMA2D_HandleTypeDef           hdma2d;
extern DSI_HandleTypeDef hdsi_eval;
}

/* Private define ------------------------------------------------------------*/
const unsigned int LCDWidth = 800;
const unsigned int LCDHeight = 480;
const unsigned int BytesPerPixel = 4; /* For ARGB8888 mode */

#define VSYNC               1 
#define VBP                 1 
#define VFP                 1
#define VACT                LCDHeight
#define HSYNC               1
#define HBP                 1
#define HFP                 1
#define HACT                LCDWidth

/* Private macro -------------------------------------------------------------*/
/* Private variables ---------------------------------------------------------*/

typedef enum {
    SwitchToDraftIsPending = 0,
    DisplayingDraft,
    CopyingDraftToFinalIsPending,
    CopyDraftToFinalIsDone, /* Unused, would be nice not to poll on DMA2D while copying */
    SwitchToFinalIsPending,
    DisplayingFinal
} LCD_Display_Update_State;

static __IO LCD_Display_Update_State display_state = SwitchToDraftIsPending;

//static uint32_t ImageIndex = 0;
/*static const uint32_t * Images[] = 
{
    image_320x240_argb8888,
    life_augmented_argb8888,
};*/

extern "C" {
    static void* const draft_fb_address = (void *)LCD_FB_START_ADDRESS;
    static void* const final_fb_address = (void *)((uint8_t*)draft_fb_address + LCDWidth*LCDHeight*BytesPerPixel);
}

/**
  * @brief  On Error Handler on condition TRUE.
  * @param  condition : Can be TRUE or FALSE
  * @retval None
  */
void OnError_Handler(uint32_t condition)
{
    if(condition) {
        BSP_LED_On(LED2);
        while(1) { ; } /* Blocking on error */
    }
}

void Error_Handler() {
	  OnError_Handler(1);
}

typedef void(*FHalDelayRefreshFunc)(void* context);

/**
 * @brief Wait for a given delay in ms, while running a function in background
 * 
 * @param toRunWhileWaiting A function to run continously while waiting
 * @param context A context pointer provided to toRunWhileWaiting as argument
 * @param Delay The delay to wait for (in ms)
 * 
 */
void waitDelay(uint32_t Delay, FHalDelayRefreshFunc toRunWhileWaiting = nullptr, void* context = nullptr) {
    uint32_t tickstart = HAL_GetTick();
    uint32_t wait = Delay;

    /* Add a freq to guarantee minimum wait */
    if (wait < HAL_MAX_DELAY) {
        wait += (uint32_t)(uwTickFreq);
    }

    while((HAL_GetTick() - tickstart) < wait) {
        if (toRunWhileWaiting != nullptr) {
            toRunWhileWaiting(context);
        }
    }
}

class TicFrameParser {
public:
    TicFrameParser() : nbFramesParsed(0) { }

    void parseFrame(const uint8_t* buf, std::size_t cnt) {
        BSP_LED_Toggle(LED1); // Toggle the green LED when a frame has been received
        this->nbFramesParsed++;
    }

    unsigned int nbFramesParsed;
};

/**
 * @brief  Main program
 * @param  None
 * @retval None
 */
int main(void) {
    uint8_t  lcd_status = LCD_OK;
    
    /* STM32F4xx HAL library initialization:
      - Configure the Flash prefetch, instruction and Data caches
      - Systick timer is configured by default as source of time base, but user 
        can eventually implement his proper time base source (a general purpose 
        timer for example or other time source), keeping in mind that Time base 
        duration should be kept 1ms since PPP_TIMEOUT_VALUEs are defined and 
        handled in milliseconds basis.
      - Set NVIC Group Priority to 4
      - Low Level Initialization: global MSP (MCU Support Package) initialization
    */
    HAL_Init();
  
    /* Configure the system clock to 180 MHz */
    SystemClock_Config();

    /* Configure LED1, LED2, LED3 and LED4 */
    BSP_LED_Init(LED1);
    BSP_LED_Init(LED2);
    BSP_LED_Init(LED3);
    BSP_LED_Init(LED4);
    BSP_LED_On(LED2);
    waitDelay(250);
    BSP_LED_Off(LED2);

    /* Initialize the SDRAM */
    BSP_SDRAM_Init();
    //BSP_SD_Init();

    Stm32Serial& ticSerial = Stm32Serial::get();

    ticSerial.start();

    //BSP_TS_Init(800,480);
    /* Initialize the LCD   */
    lcd_status = LCD_Init();
    OnError_Handler(lcd_status != LCD_OK); 

    BSP_LCD_LayerDefaultInit(0, (uint32_t)draft_fb_address);
    BSP_LCD_SelectLayer(0); 

    BSP_LCD_SetTextColor(LCD_COLOR_WHITE);
    BSP_LCD_FillRect(0, 0, LCDWidth, LCDHeight);
    BSP_LCD_SetTextColor(LCD_COLOR_RED);
    BSP_LCD_FillCircle(30, 30, 30);

    display_state = SwitchToDraftIsPending;

    HAL_DSI_Refresh(&hdsi_eval);

    while (display_state==SwitchToDraftIsPending);	/* Wait until the LCD displays the draft framebuffer */

    copy_framebuffer((const uint32_t*)draft_fb_address, (uint32_t*)final_fb_address, 0, 0, LCDWidth, LCDHeight);
    display_state = SwitchToFinalIsPending;

    HAL_DSI_Refresh(&hdsi_eval);

    ticSerial.print("Buffers created. Starting...\r\n");

    TicFrameParser ticParser;

    TICUnframer ticUnframer([](const uint8_t* buf, std::size_t cnt, void* context) {
        if (context) {  /* Failsafe, do not dereference if no context */
            TicFrameParser* frameParser = static_cast<TicFrameParser*>(context);
            frameParser->parseFrame(buf, cnt);
        }
    }, (void *)(&ticParser));

    //set_active_fb_addr(final_fb_address);	/* Draw the copy on the LCD, not the pending one */

    struct TicProcessingContext {
        /* Default constructor */
        TicProcessingContext(Stm32Serial& ticSerial, TICUnframer& ticUnframer) :
            ticSerial(ticSerial),
            ticUnframer(ticUnframer),
            lostTicBytes(0),
            serialRxOverflowCount(0) { }

        Stm32Serial& ticSerial; /*!< The encapsulated TIC serial bytes receive handler */
        TICUnframer& ticUnframer;   /*!< The encapsulated TIC frame delimiter handler */
        unsigned int lostTicBytes;    /*!< How many TIC bytes were lost due to forwarding queue overflow? */
        unsigned int serialRxOverflowCount;  /*!< How many times we didnot read fast enough the serial buffer and bytes where thus lost due to incoming serial buffer overflow */
    };

    TicProcessingContext ticContext(ticSerial, ticUnframer);

    auto streamTicRxBytesToUnframer = [](void* context) {
        if (context == nullptr)
            return;
        TicProcessingContext* ticContext = static_cast<TicProcessingContext*>(context);
        uint8_t streamedBytesBuffer[256];  /* We allow copies of max 256 bytes at a time */
        size_t incomingBytesCount = ticContext->ticSerial.read(streamedBytesBuffer, sizeof(streamedBytesBuffer));
        std::size_t processedBytesCount = ticContext->ticUnframer.pushBytes(streamedBytesBuffer, incomingBytesCount);
        if (processedBytesCount < incomingBytesCount) {
            size_t lostBytesCount = incomingBytesCount - processedBytesCount;
            if (lostBytesCount > static_cast<unsigned int>(-1)) {
                lostBytesCount = static_cast<unsigned int>(-1); /* Does not fit in an unsigned int! */
            }
            if (static_cast<unsigned int>(-1) - lostBytesCount < ticContext->lostTicBytes) {
                /* Adding lostBytesCount will imply an overflow an overflow of our counter */
                ticContext->lostTicBytes = static_cast<unsigned int>(-1); /* Maxmimize our counter, we can't do better than this */
            }
            else {
                ticContext->lostTicBytes += lostBytesCount;
            }
        }
        unsigned int serialRxOverflowCount = ticContext->ticSerial.getRxOverflowCount(true);
        if (static_cast<unsigned int>(-1) - serialRxOverflowCount < ticContext->serialRxOverflowCount) {
            /* Adding serialRxOverflowBytes will imply an overflow of our counter */
            ticContext->serialRxOverflowCount = static_cast<unsigned int>(-1); /* Maxmimize our counter, we can't do better than this */
        }
        else {
            ticContext->serialRxOverflowCount += serialRxOverflowCount;
        }
    };

